{"data":{"site":{"siteMetadata":{"title":"Custom Elements","description":"Samples of the HTML web pages that can be used as Custom Element (BETA) Extensions in Kentico Cloud. Custom elements help you with extending the basic functionality of Kentico Cloud UI and thus improving the content editing experience. Custom element is essentially a small HTML application that exists in a sandboxed <iframe> and interacts with the Kentico Cloud app via the Custom Elements API."}},"allElementsJson":{"edges":[{"node":{"id":"3a196171-3d88-5de8-ae14-20b9718b240f","title":"Components","description":"In Kentico Cloud there is linked items element as well as linked items as a part of the rich text. Then there are components as a part of the rich text, but there are components missing as a stand-alone element so editors can't create as many components as they need with no related items created.","thumbnailUrl":"https://amend.cz/components/components_item.png","readmeUrl":"https://kentico.github.io/custom-element-samples/Components"}},{"node":{"id":"5b5f1cd0-a3c9-5fb6-a1df-53e33b9fbce6","title":"Color Picker","description":"Color picker allowing user to choose a color from palette and sets it as a HEX string, e.g. '#ff0000' for red color, '#00ff00' for green, and so on. ","thumbnailUrl":"https://files.readme.io/4f023b9-custom.gif","readmeUrl":"https://kentico.github.io/custom-element-samples/ColorPicker"}},{"node":{"id":"8b05648a-ee87-5199-9931-9d28d9a028ee","title":"Markdown","description":"Markdown editor is a WYSIWYG Custom element which allows users to write formatted text using SimpleMDE. In this sample element, you can find examples of setting dynamic height and reacting on the window ‘resize’ events. When the element is disabled, the editor is set to the readonly mode.","thumbnailUrl":"https://kentico.github.io/custom-element-samples/Markdown/markdown.gif","readmeUrl":"https://kentico.github.io/custom-element-samples/Markdown"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}